In [2]:
import pandas as pd
df = pd.read_csv('C:/Users/admin/CodeBasics Machine Learning/Machine_Learning_py/5_DecisionTree/salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
input = df.drop('salary_more_then_100k',axis='columns')
target = df['salary_more_then_100k']

In [4]:
input.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [5]:
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [6]:
#As there are names in different columns will neet to do label encoding on them
from sklearn.preprocessing import LabelEncoder

In [10]:
#Will make an lable encoder object of each column we want the encoding to be done
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [11]:
#Now creating new columns with encoded version
input['company_en'] = le_company.fit_transform(input['company'])
input['job_en'] = le_job.fit_transform(input['job'])
input['degree_en'] = le_degree.fit_transform(input['degree'])

In [12]:
input.head()

  company                  job     degree  company_en  job_en  degree_en
0  google      sales executive  bachelors           2       2          0
1  google      sales executive    masters           2       2          1
2  google     business manager  bachelors           2       0          0
3  google     business manager    masters           2       0          1
4  google  computer programmer  bachelors           2       1          0

In [15]:
#creating new df with dropping column with names like company, job & description
encoded_input = input.drop(['job','company','degree'], axis='columns')
encoded_input

    company_en  job_en  degree_en
0            2       2          0
1            2       2          1
2            2       0          0
3            2       0          1
4            2       1          0
5            2       1          1
6            0       2          1
7            0       1          0
8            0       0          0
9            0       0          1
10           1       2          0
11           1       2          1
12           1       0          0
13           1       0          1
14           1       1          0
15           1       1          1

In [16]:
#importing tree from sklearn to get decision tree classifer
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [18]:
#training myt model
model.fit(encoded_input,target)

DecisionTreeClassifier()

In [19]:
#Score of the model it will be 1 as dataset is small and self created
model.score(encoded_input,target)

1.0

In [20]:
#Lets predict one random values
model.predict([[2,1,0]])

array([0], dtype=int64)

In [ ]:
# means he will not get the 100k salary